Computer-Network.org
#+TITLE=Computer Network
** Router
   路由器是一种计算机，但不是主机。是packet switching的关键构件。其任务是转发收到的分组。
   - 分组转发技术
     分组交换使用存储转发技术。通常我们把要发送的整块数据称为报文(message)。
** 协议划分
   - 应用层
     体系结构中的最高层，直接向用户进程提供服务。
     应用层中的协议如: HTTP, SMTP, FTP
   - 传输层
     主要有一下两种协议:
     - TCP (Transmission Control Protocol)--面向连接，数据传输的单位是报文段,能够提供可靠的交付。
     - UDP (User Datagram Protocol)--无连接的，数据传输单位是用户数据报，不保证可靠的交付，(best-effort-delivery)
   - 网络层 network layer
     负责为分组交换网上的主机提供通信服务。在发送数据时，网络层把运输层产生的报文段或用户数据封装成分组或包进行传送。在TCP/IP体系中，由于网络层
     使用IP协议,因此分组也叫做IP数据报，或简称数据报。网络层中的另一个任务就是要选择合适的路由，是源主机运输层所传下来的分组，能够通过路由器找到
     目的主机。
     网络层的主要协议是无连接的IP(Internet Protocol)和许多路由选择协议。因此网络层又叫网技层或IP层。
   - 数据链路层(data link layer)
     两个主机间数据传输总是在一段一段的链路上传送的。连个相邻节点（主机和路由器之间或两个路由器之间）传送数据就是直接传送的(点对点)。这是就需要专门的链路层协议。
     数据链路层将网络层中的数据。数据链路层将网络层交下来的IP数据报组装成帧(framing),在连个相邻节点间的链路上"透明"地传送帧(frame)中的数据。每一帧包括数据和必要
     的控制信息(如同步信息,地址信息,差错控制等)。典型的帧长是几百字节到一千多字节。
   - 物理层(physical layer)


